TMS320C2000 Assembler PC v22.6.0 Wed Aug 14 19:15:24 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc.asm                                                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.0.LTS *
       3              ;* Date/Time created: Wed Aug 14 19:15:23 2024                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --cla_support=cla2 --diag_wrap=off --float_support=fpu32 --hll_source=on --
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../clllc.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.0.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\ZXC\Documents\mcu project\ti-project\clllc_nonpowerSUITE_F
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("XBAR_clearInputFlag")
      16                      .dwattr $C$DW$1, DW_AT_linkage_name("XBAR_clearInputFlag")

    6058                      .dwattr $C$DW$409, DW_AT_decl_line(0x25c)
    6059                      .dwattr $C$DW$409, DW_AT_decl_column(0x05)
    6060              
    6061              $C$DW$410       .dwtag  DW_TAG_enumerator
    6062                      .dwattr $C$DW$410, DW_AT_name("XBAR_INPUT_FLG_CLB2_OUT5")
    6063                      .dwattr $C$DW$410, DW_AT_const_value(0x313)
    6064                      .dwattr $C$DW$410, DW_AT_decl_file("C:\Users\ZXC\Documents\mcu project\ti-project\clllc_nonpowerSUITE
    6065                      .dwattr $C$DW$410, DW_AT_decl_line(0x25d)
    6066                      .dwattr $C$DW$410, DW_AT_decl_column(0x05)
    6067              
    6068              $C$DW$411       .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler PC v22.6.0 Wed Aug 14 19:15:24 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc.asm                                                            PAGE  122

    6069                      .dwattr $C$DW$411, DW_AT_name("XBAR_INPUT_FLG_CLB3_OUT4")
    6070                      .dwattr $C$DW$411, DW_AT_const_value(0x314)
    6071                      .dwattr $C$DW$411, DW_AT_decl_file("C:\Users\ZXC\Documents\mcu project\ti-project\clllc_nonpowerSUITE
    6072                      .dwattr $C$DW$411, DW_AT_decl_line(0x25e)
    6073                      .dwattr $C$DW$411, DW_AT_decl_column(0x05)
    6074              
    6075              $C$DW$412       .dwtag  DW_TAG_enumerator
    6076                      .dwattr $C$DW$412, DW_AT_name("XBAR_INPUT_FLG_CLB3_OUT5")
    6077                      .dwattr $C$DW$412, DW_AT_const_value(0x315)
    6078                      .dwattr $C$DW$412, DW_AT_decl_file("C:\Users\ZXC\Documents\mcu project\ti-project\clllc_nonpowerSUITE
    6079                      .dwattr $C$DW$412, DW_AT_decl_line(0x25f)
    6080                      .dwattr $C$DW$412, DW_AT_decl_column(0x05)
    6081              
    6082              $C$DW$413       .dwtag  DW_TAG_enumerator
    6083                      .dwattr $C$DW$413, DW_AT_name("XBAR_INPUT_FLG_CLB4_OUT4")
    6084                      .dwattr $C$DW$413, DW_AT_const_value(0x316)
    6085                      .dwattr $C$DW$413, DW_AT_decl_file("C:\Users\ZXC\Documents\mcu project\ti-project\clllc_nonpowerSUITE
    6086                      .dwattr $C$DW$413, DW_AT_decl_line(0x260)
    6087                      .dwattr $C$DW$413, DW_AT_decl_column(0x05)
    6088              
    6089              $C$DW$414       .dwtag  DW_TAG_enumerator
    6090                      .dwattr $C$DW$414, DW_AT_name("XBAR_INPUT_FLG_CLB4_OUT5")
    6091                      .dwattr $C$DW$414, DW_AT_const_value(0x317)
    6092                      .dwattr $C$DW$414, DW_AT_decl_file("C:\Users\ZXC\Documents\mcu project\ti-project\clllc_nonpowerSUITE
    6093                      .dwattr $C$DW$414, DW_AT_decl_line(0x261)
    6094                      .dwattr $C$DW$414, DW_AT_decl_column(0x05)
    6095              
    6096              $C$DW$415       .dwtag  DW_TAG_enumerator
    6097                      .dwattr $C$DW$415, DW_AT_name("XBAR_INPUT_FLG_CLAHALT")
    6098                      .dwattr $C$DW$415, DW_AT_const_value(0x31f)
    6099                      .dwattr $C$DW$415, DW_AT_decl_file("C:\Users\ZXC\Documents\mcu project\ti-project\clllc_nonpowerSUITE
    6100                      .dwattr $C$DW$415, DW_AT_decl_line(0x262)
    6101                      .dwattr $C$DW$415, DW_AT_decl_column(0x05)
    6102              
    6103                      .dwattr $C$DW$T$57, DW_AT_decl_file("C:\Users\ZXC\Documents\mcu project\ti-project\clllc_nonpowerSUIT
    6104                      .dwattr $C$DW$T$57, DW_AT_decl_line(0x1f5)
    6105                      .dwattr $C$DW$T$57, DW_AT_decl_column(0x01)
    6106                      .dwendtag $C$DW$T$57
    6107              
    6108                      .dwendtag $C$DW$TU$57
    6109              
    6110              
    6111              $C$DW$TU$58     .dwtag  DW_TAG_type_unit
    6112                      .dwmtype  $C$DW$T$58
    6113              $C$DW$T$58      .dwtag  DW_TAG_typedef
    6114                      .dwattr $C$DW$T$58, DW_AT_name("XBAR_InputFlag")
    6115                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    6116                      .dwattr $C$DW$T$58, DW_AT_decl_file("C:\Users\ZXC\Documents\mcu project\ti-project\clllc_nonpowerSUIT
    6117                      .dwattr $C$DW$T$58, DW_AT_decl_line(0x263)
    6118                      .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
    6119              
    6120                      .dwendtag $C$DW$TU$58
    6121              
    6122              
    6123              $C$DW$TU$23     .dwtag  DW_TAG_type_unit
TMS320C2000 Assembler PC v22.6.0 Wed Aug 14 19:15:24 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc.asm                                                            PAGE  123

    6124                      .dwmtype  $C$DW$T$23
    6125              
    6126              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    6127                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x1a)
    6128              $C$DW$416       .dwtag  DW_TAG_member
    6129                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$20)
    6130                      .dwattr $C$DW$416, DW_AT_name("inputPtr1")
    6131                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    6132                      .dwattr $C$DW$416, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6133                      .dwattr $C$DW$416, DW_AT_decl_line(0x42)
    6134                      .dwattr $C$DW$416, DW_AT_decl_column(0x0d)
    6135              
    6136              $C$DW$417       .dwtag  DW_TAG_member
    6137                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$20)
    6138                      .dwattr $C$DW$417, DW_AT_name("inputPtr2")
    6139                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6140                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    6141                      .dwattr $C$DW$417, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6142                      .dwattr $C$DW$417, DW_AT_decl_line(0x43)
    6143                      .dwattr $C$DW$417, DW_AT_decl_column(0x0d)
    6144              
    6145              $C$DW$418       .dwtag  DW_TAG_member
    6146                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$20)
    6147                      .dwattr $C$DW$418, DW_AT_name("inputPtr3")
    6148                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6149                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    6150                      .dwattr $C$DW$418, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6151                      .dwattr $C$DW$418, DW_AT_decl_line(0x44)
    6152                      .dwattr $C$DW$418, DW_AT_decl_column(0x0d)
    6153              
    6154              $C$DW$419       .dwtag  DW_TAG_member
    6155                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$20)
    6156                      .dwattr $C$DW$419, DW_AT_name("inputPtr4")
    6157                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6158                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    6159                      .dwattr $C$DW$419, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6160                      .dwattr $C$DW$419, DW_AT_decl_line(0x45)
    6161                      .dwattr $C$DW$419, DW_AT_decl_column(0x0d)
    6162              
    6163              $C$DW$420       .dwtag  DW_TAG_member
    6164                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$20)
    6165                      .dwattr $C$DW$420, DW_AT_name("outputPtr1")
    6166                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6167                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    6168                      .dwattr $C$DW$420, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6169                      .dwattr $C$DW$420, DW_AT_decl_line(0x46)
    6170                      .dwattr $C$DW$420, DW_AT_decl_column(0x0d)
    6171              
    6172              $C$DW$421       .dwtag  DW_TAG_member
    6173                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$20)
    6174                      .dwattr $C$DW$421, DW_AT_name("outputPtr2")
    6175                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6176                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    6177                      .dwattr $C$DW$421, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6178                      .dwattr $C$DW$421, DW_AT_decl_line(0x47)
TMS320C2000 Assembler PC v22.6.0 Wed Aug 14 19:15:24 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc.asm                                                            PAGE  124

    6179                      .dwattr $C$DW$421, DW_AT_decl_column(0x0d)
    6180              
    6181              $C$DW$422       .dwtag  DW_TAG_member
    6182                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$20)
    6183                      .dwattr $C$DW$422, DW_AT_name("outputPtr3")
    6184                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6185                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    6186                      .dwattr $C$DW$422, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6187                      .dwattr $C$DW$422, DW_AT_decl_line(0x48)
    6188                      .dwattr $C$DW$422, DW_AT_decl_column(0x0d)
    6189              
    6190              $C$DW$423       .dwtag  DW_TAG_member
    6191                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$20)
    6192                      .dwattr $C$DW$423, DW_AT_name("outputPtr4")
    6193                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6194                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    6195                      .dwattr $C$DW$423, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6196                      .dwattr $C$DW$423, DW_AT_decl_line(0x49)
    6197                      .dwattr $C$DW$423, DW_AT_decl_column(0x0d)
    6198              
    6199              $C$DW$424       .dwtag  DW_TAG_member
    6200                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$19)
    6201                      .dwattr $C$DW$424, DW_AT_name("prevValue")
    6202                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6203                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    6204                      .dwattr $C$DW$424, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6205                      .dwattr $C$DW$424, DW_AT_decl_line(0x4a)
    6206                      .dwattr $C$DW$424, DW_AT_decl_column(0x0c)
    6207              
    6208              $C$DW$425       .dwtag  DW_TAG_member
    6209                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$19)
    6210                      .dwattr $C$DW$425, DW_AT_name("trigValue")
    6211                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6212                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    6213                      .dwattr $C$DW$425, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6214                      .dwattr $C$DW$425, DW_AT_decl_line(0x4b)
    6215                      .dwattr $C$DW$425, DW_AT_decl_column(0x0c)
    6216              
    6217              $C$DW$426       .dwtag  DW_TAG_member
    6218                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$22)
    6219                      .dwattr $C$DW$426, DW_AT_name("status")
    6220                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6221                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    6222                      .dwattr $C$DW$426, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6223                      .dwattr $C$DW$426, DW_AT_decl_line(0x4c)
    6224                      .dwattr $C$DW$426, DW_AT_decl_column(0x0a)
    6225              
    6226              $C$DW$427       .dwtag  DW_TAG_member
    6227                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$22)
    6228                      .dwattr $C$DW$427, DW_AT_name("preScalar")
    6229                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    6230                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    6231                      .dwattr $C$DW$427, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6232                      .dwattr $C$DW$427, DW_AT_decl_line(0x4d)
    6233                      .dwattr $C$DW$427, DW_AT_decl_column(0x0a)
TMS320C2000 Assembler PC v22.6.0 Wed Aug 14 19:15:24 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc.asm                                                            PAGE  125

    6234              
    6235              $C$DW$428       .dwtag  DW_TAG_member
    6236                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$22)
    6237                      .dwattr $C$DW$428, DW_AT_name("skipCount")
    6238                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6239                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    6240                      .dwattr $C$DW$428, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6241                      .dwattr $C$DW$428, DW_AT_decl_line(0x4e)
    6242                      .dwattr $C$DW$428, DW_AT_decl_column(0x0a)
    6243              
    6244              $C$DW$429       .dwtag  DW_TAG_member
    6245                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$22)
    6246                      .dwattr $C$DW$429, DW_AT_name("size")
    6247                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    6248                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    6249                      .dwattr $C$DW$429, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6250                      .dwattr $C$DW$429, DW_AT_decl_line(0x4f)
    6251                      .dwattr $C$DW$429, DW_AT_decl_column(0x0a)
    6252              
    6253              $C$DW$430       .dwtag  DW_TAG_member
    6254                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$22)
    6255                      .dwattr $C$DW$430, DW_AT_name("count")
    6256                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6257                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    6258                      .dwattr $C$DW$430, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6259                      .dwattr $C$DW$430, DW_AT_decl_line(0x50)
    6260                      .dwattr $C$DW$430, DW_AT_decl_column(0x0a)
    6261              
    6262                      .dwattr $C$DW$T$23, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUIT
    6263                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x41)
    6264                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x18)
    6265                      .dwendtag $C$DW$T$23
    6266              
    6267                      .dwendtag $C$DW$TU$23
    6268              
    6269              
    6270              $C$DW$TU$59     .dwtag  DW_TAG_type_unit
    6271                      .dwmtype  $C$DW$T$59
    6272              $C$DW$431       .dwtag  DW_TAG_TI_far_type
    6273                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$23)
    6274              
    6275              $C$DW$T$59      .dwtag  DW_TAG_volatile_type
    6276                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$431)
    6277              
    6278                      .dwendtag $C$DW$TU$59
    6279              
    6280              
    6281              $C$DW$TU$60     .dwtag  DW_TAG_type_unit
    6282                      .dwmtype  $C$DW$T$60
    6283              $C$DW$T$60      .dwtag  DW_TAG_typedef
    6284                      .dwattr $C$DW$T$60, DW_AT_name("DLOG_4CH")
    6285                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    6286                      .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUIT
    6287                      .dwattr $C$DW$T$60, DW_AT_decl_line(0x51)
    6288                      .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
TMS320C2000 Assembler PC v22.6.0 Wed Aug 14 19:15:24 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc.asm                                                            PAGE  126

    6289              
    6290                      .dwendtag $C$DW$TU$60
    6291              
    6292              
    6293              $C$DW$TU$24     .dwtag  DW_TAG_type_unit
    6294                      .dwmtype  $C$DW$T$24
    6295              
    6296              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    6297                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    6298              $C$DW$432       .dwtag  DW_TAG_member
    6299                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$19)
    6300                      .dwattr $C$DW$432, DW_AT_name("out")
    6301                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    6302                      .dwattr $C$DW$432, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6303                      .dwattr $C$DW$432, DW_AT_decl_line(0x47)
    6304                      .dwattr $C$DW$432, DW_AT_decl_column(0x0f)
    6305              
    6306              $C$DW$433       .dwtag  DW_TAG_member
    6307                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$19)
    6308                      .dwattr $C$DW$433, DW_AT_name("multiplier")
    6309                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6310                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    6311                      .dwattr $C$DW$433, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6312                      .dwattr $C$DW$433, DW_AT_decl_line(0x48)
    6313                      .dwattr $C$DW$433, DW_AT_decl_column(0x0f)
    6314              
    6315                      .dwattr $C$DW$T$24, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUIT
    6316                      .dwattr $C$DW$T$24, DW_AT_decl_line(0x46)
    6317                      .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    6318                      .dwendtag $C$DW$T$24
    6319              
    6320                      .dwendtag $C$DW$TU$24
    6321              
    6322              
    6323              $C$DW$TU$62     .dwtag  DW_TAG_type_unit
    6324                      .dwmtype  $C$DW$T$62
    6325              $C$DW$T$62      .dwtag  DW_TAG_typedef
    6326                      .dwattr $C$DW$T$62, DW_AT_name("EMAVG")
    6327                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$24)
    6328                      .dwattr $C$DW$T$62, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUIT
    6329                      .dwattr $C$DW$T$62, DW_AT_decl_line(0x49)
    6330                      .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    6331              
    6332                      .dwendtag $C$DW$TU$62
    6333              
    6334              
    6335              $C$DW$TU$25     .dwtag  DW_TAG_type_unit
    6336                      .dwmtype  $C$DW$T$25
    6337              
    6338              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    6339                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x20)
    6340              $C$DW$434       .dwtag  DW_TAG_member
    6341                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$20)
    6342                      .dwattr $C$DW$434, DW_AT_name("h_magVect")
    6343                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Wed Aug 14 19:15:24 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc.asm                                                            PAGE  127

    6344                      .dwattr $C$DW$434, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6345                      .dwattr $C$DW$434, DW_AT_decl_line(0x40)
    6346                      .dwattr $C$DW$434, DW_AT_decl_column(0x10)
    6347              
    6348              $C$DW$435       .dwtag  DW_TAG_member
    6349                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$20)
    6350                      .dwattr $C$DW$435, DW_AT_name("h_phaseVect")
    6351                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6352                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    6353                      .dwattr $C$DW$435, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6354                      .dwattr $C$DW$435, DW_AT_decl_line(0x41)
    6355                      .dwattr $C$DW$435, DW_AT_decl_column(0x10)
    6356              
    6357              $C$DW$436       .dwtag  DW_TAG_member
    6358                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$20)
    6359                      .dwattr $C$DW$436, DW_AT_name("gh_magVect")
    6360                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6361                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    6362                      .dwattr $C$DW$436, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6363                      .dwattr $C$DW$436, DW_AT_decl_line(0x42)
    6364                      .dwattr $C$DW$436, DW_AT_decl_column(0x10)
    6365              
    6366              $C$DW$437       .dwtag  DW_TAG_member
    6367                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$20)
    6368                      .dwattr $C$DW$437, DW_AT_name("gh_phaseVect")
    6369                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6370                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    6371                      .dwattr $C$DW$437, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6372                      .dwattr $C$DW$437, DW_AT_decl_line(0x43)
    6373                      .dwattr $C$DW$437, DW_AT_decl_column(0x10)
    6374              
    6375              $C$DW$438       .dwtag  DW_TAG_member
    6376                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$20)
    6377                      .dwattr $C$DW$438, DW_AT_name("cl_magVect")
    6378                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6379                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    6380                      .dwattr $C$DW$438, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6381                      .dwattr $C$DW$438, DW_AT_decl_line(0x44)
    6382                      .dwattr $C$DW$438, DW_AT_decl_column(0x10)
    6383              
    6384              $C$DW$439       .dwtag  DW_TAG_member
    6385                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$20)
    6386                      .dwattr $C$DW$439, DW_AT_name("cl_phaseVect")
    6387                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6388                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    6389                      .dwattr $C$DW$439, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6390                      .dwattr $C$DW$439, DW_AT_decl_line(0x45)
    6391                      .dwattr $C$DW$439, DW_AT_decl_column(0x10)
    6392              
    6393              $C$DW$440       .dwtag  DW_TAG_member
    6394                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$20)
    6395                      .dwattr $C$DW$440, DW_AT_name("freqVect")
    6396                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6397                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    6398                      .dwattr $C$DW$440, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
TMS320C2000 Assembler PC v22.6.0 Wed Aug 14 19:15:24 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc.asm                                                            PAGE  128

    6399                      .dwattr $C$DW$440, DW_AT_decl_line(0x46)
    6400                      .dwattr $C$DW$440, DW_AT_decl_column(0x10)
    6401              
    6402              $C$DW$441       .dwtag  DW_TAG_member
    6403                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$19)
    6404                      .dwattr $C$DW$441, DW_AT_name("amplitude")
    6405                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6406                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    6407                      .dwattr $C$DW$441, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6408                      .dwattr $C$DW$441, DW_AT_decl_line(0x47)
    6409                      .dwattr $C$DW$441, DW_AT_decl_column(0x0f)
    6410              
    6411              $C$DW$442       .dwtag  DW_TAG_member
    6412                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$19)
    6413                      .dwattr $C$DW$442, DW_AT_name("isrFreq")
    6414                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6415                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    6416                      .dwattr $C$DW$442, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6417                      .dwattr $C$DW$442, DW_AT_decl_line(0x48)
    6418                      .dwattr $C$DW$442, DW_AT_decl_column(0x0f)
    6419              
    6420              $C$DW$443       .dwtag  DW_TAG_member
    6421                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$19)
    6422                      .dwattr $C$DW$443, DW_AT_name("freqStart")
    6423                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6424                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    6425                      .dwattr $C$DW$443, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6426                      .dwattr $C$DW$443, DW_AT_decl_line(0x49)
    6427                      .dwattr $C$DW$443, DW_AT_decl_column(0x0f)
    6428              
    6429              $C$DW$444       .dwtag  DW_TAG_member
    6430                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$19)
    6431                      .dwattr $C$DW$444, DW_AT_name("freqStep")
    6432                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6433                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    6434                      .dwattr $C$DW$444, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6435                      .dwattr $C$DW$444, DW_AT_decl_line(0x4a)
    6436                      .dwattr $C$DW$444, DW_AT_decl_column(0x0f)
    6437              
    6438              $C$DW$445       .dwtag  DW_TAG_member
    6439                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$22)
    6440                      .dwattr $C$DW$445, DW_AT_name("start")
    6441                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6442                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    6443                      .dwattr $C$DW$445, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6444                      .dwattr $C$DW$445, DW_AT_decl_line(0x4b)
    6445                      .dwattr $C$DW$445, DW_AT_decl_column(0x0d)
    6446              
    6447              $C$DW$446       .dwtag  DW_TAG_member
    6448                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$22)
    6449                      .dwattr $C$DW$446, DW_AT_name("state")
    6450                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    6451                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    6452                      .dwattr $C$DW$446, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6453                      .dwattr $C$DW$446, DW_AT_decl_line(0x4c)
TMS320C2000 Assembler PC v22.6.0 Wed Aug 14 19:15:24 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc.asm                                                            PAGE  129

    6454                      .dwattr $C$DW$446, DW_AT_decl_column(0x0d)
    6455              
    6456              $C$DW$447       .dwtag  DW_TAG_member
    6457                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$22)
    6458                      .dwattr $C$DW$447, DW_AT_name("status")
    6459                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6460                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    6461                      .dwattr $C$DW$447, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6462                      .dwattr $C$DW$447, DW_AT_decl_line(0x4d)
    6463                      .dwattr $C$DW$447, DW_AT_decl_column(0x0d)
    6464              
    6465              $C$DW$448       .dwtag  DW_TAG_member
    6466                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$22)
    6467                      .dwattr $C$DW$448, DW_AT_name("vecLength")
    6468                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    6469                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    6470                      .dwattr $C$DW$448, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6471                      .dwattr $C$DW$448, DW_AT_decl_line(0x4e)
    6472                      .dwattr $C$DW$448, DW_AT_decl_column(0x0d)
    6473              
    6474              $C$DW$449       .dwtag  DW_TAG_member
    6475                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$22)
    6476                      .dwattr $C$DW$449, DW_AT_name("freqIndex")
    6477                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6478                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    6479                      .dwattr $C$DW$449, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6480                      .dwattr $C$DW$449, DW_AT_decl_line(0x4f)
    6481                      .dwattr $C$DW$449, DW_AT_decl_column(0x0d)
    6482              
    6483              $C$DW$450       .dwtag  DW_TAG_member
    6484                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$22)
    6485                      .dwattr $C$DW$450, DW_AT_name("storeH")
    6486                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    6487                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    6488                      .dwattr $C$DW$450, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6489                      .dwattr $C$DW$450, DW_AT_decl_line(0x50)
    6490                      .dwattr $C$DW$450, DW_AT_decl_column(0x0d)
    6491              
    6492              $C$DW$451       .dwtag  DW_TAG_member
    6493                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$22)
    6494                      .dwattr $C$DW$451, DW_AT_name("storeGH")
    6495                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6496                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    6497                      .dwattr $C$DW$451, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6498                      .dwattr $C$DW$451, DW_AT_decl_line(0x51)
    6499                      .dwattr $C$DW$451, DW_AT_decl_column(0x0d)
    6500              
    6501              $C$DW$452       .dwtag  DW_TAG_member
    6502                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$22)
    6503                      .dwattr $C$DW$452, DW_AT_name("storeCL")
    6504                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    6505                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    6506                      .dwattr $C$DW$452, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6507                      .dwattr $C$DW$452, DW_AT_decl_line(0x52)
    6508                      .dwattr $C$DW$452, DW_AT_decl_column(0x0d)
TMS320C2000 Assembler PC v22.6.0 Wed Aug 14 19:15:24 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc.asm                                                            PAGE  130

    6509              
    6510              $C$DW$453       .dwtag  DW_TAG_member
    6511                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$22)
    6512                      .dwattr $C$DW$453, DW_AT_name("speed")
    6513                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6514                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    6515                      .dwattr $C$DW$453, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    6516                      .dwattr $C$DW$453, DW_AT_decl_line(0x53)
    6517                      .dwattr $C$DW$453, DW_AT_decl_column(0x0d)
    6518              
    6519                      .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUIT
    6520                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x3f)
    6521                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x0f)
    6522                      .dwendtag $C$DW$T$25
    6523              
    6524                      .dwendtag $C$DW$TU$25
    6525              
    6526              
    6527              $C$DW$TU$64     .dwtag  DW_TAG_type_unit
    6528                      .dwmtype  $C$DW$T$64
    6529              $C$DW$T$64      .dwtag  DW_TAG_typedef
    6530                      .dwattr $C$DW$T$64, DW_AT_name("SFRA_F32")
    6531                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$25)
    6532                      .dwattr $C$DW$T$64, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUIT
    6533                      .dwattr $C$DW$T$64, DW_AT_decl_line(0x54)
    6534                      .dwattr $C$DW$T$64, DW_AT_decl_column(0x02)
    6535              
    6536                      .dwendtag $C$DW$TU$64
    6537              
    6538              
    6539              $C$DW$TU$65     .dwtag  DW_TAG_type_unit
    6540                      .dwmtype  $C$DW$T$65
    6541              $C$DW$T$65      .dwtag  DW_TAG_pointer_type
    6542                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    6543                      .dwattr $C$DW$T$65, DW_AT_address_class(0x20)
    6544              
    6545                      .dwendtag $C$DW$TU$65
    6546              
    6547              
    6548              $C$DW$TU$29     .dwtag  DW_TAG_type_unit
    6549                      .dwmtype  $C$DW$T$29
    6550              
    6551              $C$DW$T$29      .dwtag  DW_TAG_union_type
    6552                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    6553              $C$DW$454       .dwtag  DW_TAG_member
    6554                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$26)
    6555                      .dwattr $C$DW$454, DW_AT_name("CLLLC_Lab_Enum")
    6556                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    6557                      .dwattr $C$DW$454, DW_AT_decl_file("..\clllc.h")
    6558                      .dwattr $C$DW$454, DW_AT_decl_line(0xcd)
    6559                      .dwattr $C$DW$454, DW_AT_decl_column(0x06)
    6560              
    6561              $C$DW$455       .dwtag  DW_TAG_member
    6562                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$28)
    6563                      .dwattr $C$DW$455, DW_AT_name("pad")
TMS320C2000 Assembler PC v22.6.0 Wed Aug 14 19:15:24 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc.asm                                                            PAGE  131

    6564                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    6565                      .dwattr $C$DW$455, DW_AT_decl_file("..\clllc.h")
    6566                      .dwattr $C$DW$455, DW_AT_decl_line(0xce)
    6567                      .dwattr $C$DW$455, DW_AT_decl_column(0x0d)
    6568              
    6569                      .dwattr $C$DW$T$29, DW_AT_decl_file("..\clllc.h")
    6570                      .dwattr $C$DW$T$29, DW_AT_decl_line(0xb9)
    6571                      .dwattr $C$DW$T$29, DW_AT_decl_column(0x0e)
    6572                      .dwendtag $C$DW$T$29
    6573              
    6574                      .dwendtag $C$DW$TU$29
    6575              
    6576              
    6577              $C$DW$TU$67     .dwtag  DW_TAG_type_unit
    6578                      .dwmtype  $C$DW$T$67
    6579              $C$DW$T$67      .dwtag  DW_TAG_typedef
    6580                      .dwattr $C$DW$T$67, DW_AT_name("CLLLC_Lab_EnumType")
    6581                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$29)
    6582                      .dwattr $C$DW$T$67, DW_AT_decl_file("..\clllc.h")
    6583                      .dwattr $C$DW$T$67, DW_AT_decl_line(0xcf)
    6584                      .dwattr $C$DW$T$67, DW_AT_decl_column(0x02)
    6585              
    6586                      .dwendtag $C$DW$TU$67
    6587              
    6588              
    6589              $C$DW$TU$31     .dwtag  DW_TAG_type_unit
    6590                      .dwmtype  $C$DW$T$31
    6591              
    6592              $C$DW$T$31      .dwtag  DW_TAG_union_type
    6593                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    6594              $C$DW$456       .dwtag  DW_TAG_member
    6595                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$30)
    6596                      .dwattr $C$DW$456, DW_AT_name("CLLLC_TripFlag_Enum")
    6597                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    6598                      .dwattr $C$DW$456, DW_AT_decl_file("..\clllc.h")
    6599                      .dwattr $C$DW$456, DW_AT_decl_line(0xdc)
    6600                      .dwattr $C$DW$456, DW_AT_decl_column(0x06)
    6601              
    6602              $C$DW$457       .dwtag  DW_TAG_member
    6603                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$28)
    6604                      .dwattr $C$DW$457, DW_AT_name("pad")
    6605                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    6606                      .dwattr $C$DW$457, DW_AT_decl_file("..\clllc.h")
    6607                      .dwattr $C$DW$457, DW_AT_decl_line(0xdd)
    6608                      .dwattr $C$DW$457, DW_AT_decl_column(0x0d)
    6609              
    6610                      .dwattr $C$DW$T$31, DW_AT_decl_file("..\clllc.h")
    6611                      .dwattr $C$DW$T$31, DW_AT_decl_line(0xd3)
    6612                      .dwattr $C$DW$T$31, DW_AT_decl_column(0x0e)
    6613                      .dwendtag $C$DW$T$31
    6614              
    6615                      .dwendtag $C$DW$TU$31
    6616              
    6617              
    6618              $C$DW$TU$68     .dwtag  DW_TAG_type_unit
TMS320C2000 Assembler PC v22.6.0 Wed Aug 14 19:15:24 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc.asm                                                            PAGE  132

    6619                      .dwmtype  $C$DW$T$68
    6620              $C$DW$T$68      .dwtag  DW_TAG_typedef
    6621                      .dwattr $C$DW$T$68, DW_AT_name("CLLLC_TripFlag_EnumType")
    6622                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$31)
    6623                      .dwattr $C$DW$T$68, DW_AT_decl_file("..\clllc.h")
    6624                      .dwattr $C$DW$T$68, DW_AT_decl_line(0xde)
    6625                      .dwattr $C$DW$T$68, DW_AT_decl_column(0x02)
    6626              
    6627                      .dwendtag $C$DW$TU$68
    6628              
    6629              
    6630              $C$DW$TU$33     .dwtag  DW_TAG_type_unit
    6631                      .dwmtype  $C$DW$T$33
    6632              
    6633              $C$DW$T$33      .dwtag  DW_TAG_union_type
    6634                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    6635              $C$DW$458       .dwtag  DW_TAG_member
    6636                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$32)
    6637                      .dwattr $C$DW$458, DW_AT_name("CLLLC_PwmSwState_Enum")
    6638                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    6639                      .dwattr $C$DW$458, DW_AT_decl_file("..\clllc.h")
    6640                      .dwattr $C$DW$458, DW_AT_decl_line(0xe9)
    6641                      .dwattr $C$DW$458, DW_AT_decl_column(0x06)
    6642              
    6643              $C$DW$459       .dwtag  DW_TAG_member
    6644                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$28)
    6645                      .dwattr $C$DW$459, DW_AT_name("pad")
    6646                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    6647                      .dwattr $C$DW$459, DW_AT_decl_file("..\clllc.h")
    6648                      .dwattr $C$DW$459, DW_AT_decl_line(0xea)
    6649                      .dwattr $C$DW$459, DW_AT_decl_column(0x0d)
    6650              
    6651                      .dwattr $C$DW$T$33, DW_AT_decl_file("..\clllc.h")
    6652                      .dwattr $C$DW$T$33, DW_AT_decl_line(0xe2)
    6653                      .dwattr $C$DW$T$33, DW_AT_decl_column(0x0e)
    6654                      .dwendtag $C$DW$T$33
    6655              
    6656                      .dwendtag $C$DW$TU$33
    6657              
    6658              
    6659              $C$DW$TU$69     .dwtag  DW_TAG_type_unit
    6660                      .dwmtype  $C$DW$T$69
    6661              $C$DW$T$69      .dwtag  DW_TAG_typedef
    6662                      .dwattr $C$DW$T$69, DW_AT_name("CLLLC_PwmSwState_EnumType")
    6663                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$33)
    6664                      .dwattr $C$DW$T$69, DW_AT_decl_file("..\clllc.h")
    6665                      .dwattr $C$DW$T$69, DW_AT_decl_line(0xeb)
    6666                      .dwattr $C$DW$T$69, DW_AT_decl_column(0x02)
    6667              
    6668                      .dwendtag $C$DW$TU$69
    6669              
    6670              
    6671              $C$DW$TU$35     .dwtag  DW_TAG_type_unit
    6672                      .dwmtype  $C$DW$T$35
    6673              
TMS320C2000 Assembler PC v22.6.0 Wed Aug 14 19:15:24 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc.asm                                                            PAGE  133

    6674              $C$DW$T$35      .dwtag  DW_TAG_union_type
    6675                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    6676              $C$DW$460       .dwtag  DW_TAG_member
    6677                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$34)
    6678                      .dwattr $C$DW$460, DW_AT_name("CLLLC_PowerFlowState_Enum")
    6679                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    6680                      .dwattr $C$DW$460, DW_AT_decl_file("..\clllc.h")
    6681                      .dwattr $C$DW$460, DW_AT_decl_line(0xf5)
    6682                      .dwattr $C$DW$460, DW_AT_decl_column(0x06)
    6683              
    6684              $C$DW$461       .dwtag  DW_TAG_member
    6685                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$28)
    6686                      .dwattr $C$DW$461, DW_AT_name("pad")
    6687                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    6688                      .dwattr $C$DW$461, DW_AT_decl_file("..\clllc.h")
    6689                      .dwattr $C$DW$461, DW_AT_decl_line(0xf6)
    6690                      .dwattr $C$DW$461, DW_AT_decl_column(0x0d)
    6691              
    6692                      .dwattr $C$DW$T$35, DW_AT_decl_file("..\clllc.h")
    6693                      .dwattr $C$DW$T$35, DW_AT_decl_line(0xef)
    6694                      .dwattr $C$DW$T$35, DW_AT_decl_column(0x0e)
    6695                      .dwendtag $C$DW$T$35
    6696              
    6697                      .dwendtag $C$DW$TU$35
    6698              
    6699              
    6700              $C$DW$TU$70     .dwtag  DW_TAG_type_unit
    6701                      .dwmtype  $C$DW$T$70
    6702              $C$DW$T$70      .dwtag  DW_TAG_typedef
    6703                      .dwattr $C$DW$T$70, DW_AT_name("CLLLC_PowerFlowState_EnumType")
    6704                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$35)
    6705                      .dwattr $C$DW$T$70, DW_AT_decl_file("..\clllc.h")
    6706                      .dwattr $C$DW$T$70, DW_AT_decl_line(0xf7)
    6707                      .dwattr $C$DW$T$70, DW_AT_decl_column(0x02)
    6708              
    6709                      .dwendtag $C$DW$TU$70
    6710              
    6711              
    6712              $C$DW$TU$37     .dwtag  DW_TAG_type_unit
    6713                      .dwmtype  $C$DW$T$37
    6714              
    6715              $C$DW$T$37      .dwtag  DW_TAG_union_type
    6716                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    6717              $C$DW$462       .dwtag  DW_TAG_member
    6718                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$36)
    6719                      .dwattr $C$DW$462, DW_AT_name("CLLLC_CommandSentTo_AC_DC_Enum")
    6720                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    6721                      .dwattr $C$DW$462, DW_AT_decl_file("..\clllc.h")
    6722                      .dwattr $C$DW$462, DW_AT_decl_line(0x102)
    6723                      .dwattr $C$DW$462, DW_AT_decl_column(0x06)
    6724              
    6725              $C$DW$463       .dwtag  DW_TAG_member
    6726                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$28)
    6727                      .dwattr $C$DW$463, DW_AT_name("pad")
    6728                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Wed Aug 14 19:15:24 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc.asm                                                            PAGE  134

    6729                      .dwattr $C$DW$463, DW_AT_decl_file("..\clllc.h")
    6730                      .dwattr $C$DW$463, DW_AT_decl_line(0x103)
    6731                      .dwattr $C$DW$463, DW_AT_decl_column(0x0d)
    6732              
    6733                      .dwattr $C$DW$T$37, DW_AT_decl_file("..\clllc.h")
    6734                      .dwattr $C$DW$T$37, DW_AT_decl_line(0xfc)
    6735                      .dwattr $C$DW$T$37, DW_AT_decl_column(0x0e)
    6736                      .dwendtag $C$DW$T$37
    6737              
    6738                      .dwendtag $C$DW$TU$37
    6739              
    6740              
    6741              $C$DW$TU$71     .dwtag  DW_TAG_type_unit
    6742                      .dwmtype  $C$DW$T$71
    6743              $C$DW$T$71      .dwtag  DW_TAG_typedef
    6744                      .dwattr $C$DW$T$71, DW_AT_name("CLLLC_CommandSentTo_AC_DC_EnumType")
    6745                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$37)
    6746                      .dwattr $C$DW$T$71, DW_AT_decl_file("..\clllc.h")
    6747                      .dwattr $C$DW$T$71, DW_AT_decl_line(0x104)
    6748                      .dwattr $C$DW$T$71, DW_AT_decl_column(0x02)
    6749              
    6750                      .dwendtag $C$DW$TU$71
    6751              
    6752              
    6753              $C$DW$TU$39     .dwtag  DW_TAG_type_unit
    6754                      .dwmtype  $C$DW$T$39
    6755              
    6756              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6757                      .dwattr $C$DW$T$39, DW_AT_name("_Complex_double")
    6758                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x08)
    6759              $C$DW$464       .dwtag  DW_TAG_member
    6760                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$38)
    6761                      .dwattr $C$DW$464, DW_AT_name("_Vals")
    6762                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    6763                      .dwattr $C$DW$464, DW_AT_decl_file("..\clllc_hal.h")
    6764                      .dwattr $C$DW$464, DW_AT_decl_line(0x11c)
    6765                      .dwattr $C$DW$464, DW_AT_decl_column(0x14)
    6766              
    6767                      .dwendtag $C$DW$T$39
    6768              
    6769                      .dwendtag $C$DW$TU$39
    6770              
    6771              
    6772              $C$DW$TU$72     .dwtag  DW_TAG_type_unit
    6773                      .dwmtype  $C$DW$T$72
    6774              $C$DW$T$72      .dwtag  DW_TAG_typedef
    6775                      .dwattr $C$DW$T$72, DW_AT_name("_Complex_double")
    6776                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$39)
    6777                      .dwattr $C$DW$T$72, DW_AT_decl_file("..\clllc_hal.h")
    6778                      .dwattr $C$DW$T$72, DW_AT_decl_line(0x11c)
    6779                      .dwattr $C$DW$T$72, DW_AT_decl_column(0x14)
    6780              
    6781                      .dwendtag $C$DW$TU$72
    6782              
    6783              
TMS320C2000 Assembler PC v22.6.0 Wed Aug 14 19:15:24 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc.asm                                                            PAGE  135

    6784              $C$DW$TU$41     .dwtag  DW_TAG_type_unit
    6785                      .dwmtype  $C$DW$T$41
    6786              
    6787              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    6788                      .dwattr $C$DW$T$41, DW_AT_name("_Complex_float")
    6789                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    6790              $C$DW$465       .dwtag  DW_TAG_member
    6791                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$40)
    6792                      .dwattr $C$DW$465, DW_AT_name("_Vals")
    6793                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    6794                      .dwattr $C$DW$465, DW_AT_decl_file("..\clllc_hal.h")
    6795                      .dwattr $C$DW$465, DW_AT_decl_line(0x11c)
    6796                      .dwattr $C$DW$465, DW_AT_decl_column(0x14)
    6797              
    6798                      .dwendtag $C$DW$T$41
    6799              
    6800                      .dwendtag $C$DW$TU$41
    6801              
    6802              
    6803              $C$DW$TU$73     .dwtag  DW_TAG_type_unit
    6804                      .dwmtype  $C$DW$T$73
    6805              $C$DW$T$73      .dwtag  DW_TAG_typedef
    6806                      .dwattr $C$DW$T$73, DW_AT_name("_Complex_float")
    6807                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$41)
    6808                      .dwattr $C$DW$T$73, DW_AT_decl_file("..\clllc_hal.h")
    6809                      .dwattr $C$DW$T$73, DW_AT_decl_line(0x11c)
    6810                      .dwattr $C$DW$T$73, DW_AT_decl_column(0x14)
    6811              
    6812                      .dwendtag $C$DW$TU$73
    6813              
    6814              
    6815              $C$DW$TU$43     .dwtag  DW_TAG_type_unit
    6816                      .dwmtype  $C$DW$T$43
    6817              
    6818              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    6819                      .dwattr $C$DW$T$43, DW_AT_name("_Complex_long_double")
    6820                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x08)
    6821              $C$DW$466       .dwtag  DW_TAG_member
    6822                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$42)
    6823                      .dwattr $C$DW$466, DW_AT_name("_Vals")
    6824                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    6825                      .dwattr $C$DW$466, DW_AT_decl_file("..\clllc_hal.h")
    6826                      .dwattr $C$DW$466, DW_AT_decl_line(0x11c)
    6827                      .dwattr $C$DW$466, DW_AT_decl_column(0x14)
    6828              
    6829                      .dwendtag $C$DW$T$43
    6830              
    6831                      .dwendtag $C$DW$TU$43
    6832              
    6833              
    6834              $C$DW$TU$75     .dwtag  DW_TAG_type_unit
    6835                      .dwmtype  $C$DW$T$75
    6836              $C$DW$T$75      .dwtag  DW_TAG_typedef
    6837                      .dwattr $C$DW$T$75, DW_AT_name("_Complex_long_double")
    6838                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$43)
TMS320C2000 Assembler PC v22.6.0 Wed Aug 14 19:15:24 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc.asm                                                            PAGE  136

    6839                      .dwattr $C$DW$T$75, DW_AT_decl_file("..\clllc_hal.h")
    6840                      .dwattr $C$DW$T$75, DW_AT_decl_line(0x11c)
    6841                      .dwattr $C$DW$T$75, DW_AT_decl_column(0x14)
    6842              
    6843                      .dwendtag $C$DW$TU$75
    6844              
    6845              
    6846              $C$DW$TU$2      .dwtag  DW_TAG_type_unit
    6847                      .dwmtype  $C$DW$T$2
    6848              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    6849                      .dwattr $C$DW$T$2, DW_AT_name("void")
    6850              
    6851                      .dwendtag $C$DW$TU$2
    6852              
    6853              
    6854              $C$DW$TU$4      .dwtag  DW_TAG_type_unit
    6855                      .dwmtype  $C$DW$T$4
    6856              $C$DW$T$4       .dwtag  DW_TAG_base_type
    6857                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    6858                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    6859                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    6860              
    6861                      .dwendtag $C$DW$TU$4
    6862              
    6863              
    6864              $C$DW$TU$5      .dwtag  DW_TAG_type_unit
    6865                      .dwmtype  $C$DW$T$5
    6866              $C$DW$T$5       .dwtag  DW_TAG_base_type
    6867                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    6868                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    6869                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    6870              
    6871                      .dwendtag $C$DW$TU$5
    6872              
    6873              
    6874              $C$DW$TU$6      .dwtag  DW_TAG_type_unit
    6875                      .dwmtype  $C$DW$T$6
    6876              $C$DW$T$6       .dwtag  DW_TAG_base_type
    6877                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    6878                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    6879                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    6880              
    6881                      .dwendtag $C$DW$TU$6
    6882              
    6883              
    6884              $C$DW$TU$7      .dwtag  DW_TAG_type_unit
    6885                      .dwmtype  $C$DW$T$7
    6886              $C$DW$T$7       .dwtag  DW_TAG_base_type
    6887                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    6888                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    6889                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    6890              
    6891                      .dwendtag $C$DW$TU$7
    6892              
    6893              
TMS320C2000 Assembler PC v22.6.0 Wed Aug 14 19:15:24 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc.asm                                                            PAGE  137

    6894              $C$DW$TU$8      .dwtag  DW_TAG_type_unit
    6895                      .dwmtype  $C$DW$T$8
    6896              $C$DW$T$8       .dwtag  DW_TAG_base_type
    6897                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    6898                      .dwattr $C$DW$T$8, DW_AT_name("short")
    6899                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    6900              
    6901                      .dwendtag $C$DW$TU$8
    6902              
    6903              
    6904              $C$DW$TU$9      .dwtag  DW_TAG_type_unit
    6905                      .dwmtype  $C$DW$T$9
    6906              $C$DW$T$9       .dwtag  DW_TAG_base_type
    6907                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    6908                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    6909                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    6910              
    6911                      .dwendtag $C$DW$TU$9
    6912              
    6913              
    6914              $C$DW$TU$10     .dwtag  DW_TAG_type_unit
    6915                      .dwmtype  $C$DW$T$10
    6916              $C$DW$T$10      .dwtag  DW_TAG_base_type
    6917                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    6918                      .dwattr $C$DW$T$10, DW_AT_name("int")
    6919                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    6920              
    6921                      .dwendtag $C$DW$TU$10
    6922              
    6923              
    6924              $C$DW$TU$21     .dwtag  DW_TAG_type_unit
    6925                      .dwmtype  $C$DW$T$21
    6926              $C$DW$T$21      .dwtag  DW_TAG_typedef
    6927                      .dwattr $C$DW$T$21, DW_AT_name("__int16_t")
    6928                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$10)
    6929                      .dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/ccs1240/ccs/tools/compiler/ti-cgt-c2000_22.6.0.LTS/include
    6930                      .dwattr $C$DW$T$21, DW_AT_decl_line(0x40)
    6931                      .dwattr $C$DW$T$21, DW_AT_decl_column(0x1d)
    6932              
    6933                      .dwendtag $C$DW$TU$21
    6934              
    6935              
    6936              $C$DW$TU$22     .dwtag  DW_TAG_type_unit
    6937                      .dwmtype  $C$DW$T$22
    6938              $C$DW$T$22      .dwtag  DW_TAG_typedef
    6939                      .dwattr $C$DW$T$22, DW_AT_name("int16_t")
    6940                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    6941                      .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1240/ccs/tools/compiler/ti-cgt-c2000_22.6.0.LTS/include
    6942                      .dwattr $C$DW$T$22, DW_AT_decl_line(0x2b)
    6943                      .dwattr $C$DW$T$22, DW_AT_decl_column(0x14)
    6944              
    6945                      .dwendtag $C$DW$TU$22
    6946              
    6947              
    6948              $C$DW$TU$11     .dwtag  DW_TAG_type_unit
TMS320C2000 Assembler PC v22.6.0 Wed Aug 14 19:15:24 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc.asm                                                            PAGE  138

    6949                      .dwmtype  $C$DW$T$11
    6950              $C$DW$T$11      .dwtag  DW_TAG_base_type
    6951                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    6952                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    6953                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    6954              
    6955                      .dwendtag $C$DW$TU$11
    6956              
    6957              
    6958              $C$DW$TU$80     .dwtag  DW_TAG_type_unit
    6959                      .dwmtype  $C$DW$T$80
    6960              $C$DW$T$80      .dwtag  DW_TAG_typedef
    6961                      .dwattr $C$DW$T$80, DW_AT_name("__uint16_t")
    6962                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$11)
    6963                      .dwattr $C$DW$T$80, DW_AT_decl_file("C:/ti/ccs1240/ccs/tools/compiler/ti-cgt-c2000_22.6.0.LTS/include
    6964                      .dwattr $C$DW$T$80, DW_AT_decl_line(0x41)
    6965                      .dwattr $C$DW$T$80, DW_AT_decl_column(0x1c)
    6966              
    6967                      .dwendtag $C$DW$TU$80
    6968              
    6969              
    6970              $C$DW$TU$81     .dwtag  DW_TAG_type_unit
    6971                      .dwmtype  $C$DW$T$81
    6972              $C$DW$T$81      .dwtag  DW_TAG_typedef
    6973                      .dwattr $C$DW$T$81, DW_AT_name("uint16_t")
    6974                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    6975                      .dwattr $C$DW$T$81, DW_AT_decl_file("C:/ti/ccs1240/ccs/tools/compiler/ti-cgt-c2000_22.6.0.LTS/include
    6976                      .dwattr $C$DW$T$81, DW_AT_decl_line(0x41)
    6977                      .dwattr $C$DW$T$81, DW_AT_decl_column(0x15)
    6978              
    6979                      .dwendtag $C$DW$TU$81
    6980              
    6981              
    6982              $C$DW$TU$108    .dwtag  DW_TAG_type_unit
    6983                      .dwmtype  $C$DW$T$108
    6984              $C$DW$467       .dwtag  DW_TAG_TI_far_type
    6985                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$81)
    6986              
    6987              $C$DW$T$108     .dwtag  DW_TAG_volatile_type
    6988                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$467)
    6989              
    6990                      .dwendtag $C$DW$TU$108
    6991              
    6992              
    6993              $C$DW$TU$109    .dwtag  DW_TAG_type_unit
    6994                      .dwmtype  $C$DW$T$109
    6995              $C$DW$468       .dwtag  DW_TAG_TI_far_type
    6996                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$81)
    6997              
    6998              $C$DW$T$109     .dwtag  DW_TAG_const_type
    6999                      .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$468)
    7000              
    7001                      .dwendtag $C$DW$TU$109
    7002              
    7003              
TMS320C2000 Assembler PC v22.6.0 Wed Aug 14 19:15:24 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc.asm                                                            PAGE  139

    7004              $C$DW$TU$12     .dwtag  DW_TAG_type_unit
    7005                      .dwmtype  $C$DW$T$12
    7006              $C$DW$T$12      .dwtag  DW_TAG_base_type
    7007                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    7008                      .dwattr $C$DW$T$12, DW_AT_name("long")
    7009                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    7010              
    7011                      .dwendtag $C$DW$TU$12
    7012              
    7013              
    7014              $C$DW$TU$27     .dwtag  DW_TAG_type_unit
    7015                      .dwmtype  $C$DW$T$27
    7016              $C$DW$T$27      .dwtag  DW_TAG_typedef
    7017                      .dwattr $C$DW$T$27, DW_AT_name("__int32_t")
    7018                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$12)
    7019                      .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/ccs1240/ccs/tools/compiler/ti-cgt-c2000_22.6.0.LTS/include
    7020                      .dwattr $C$DW$T$27, DW_AT_decl_line(0x42)
    7021                      .dwattr $C$DW$T$27, DW_AT_decl_column(0x1d)
    7022              
    7023                      .dwendtag $C$DW$TU$27
    7024              
    7025              
    7026              $C$DW$TU$28     .dwtag  DW_TAG_type_unit
    7027                      .dwmtype  $C$DW$T$28
    7028              $C$DW$T$28      .dwtag  DW_TAG_typedef
    7029                      .dwattr $C$DW$T$28, DW_AT_name("int32_t")
    7030                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    7031                      .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/ccs1240/ccs/tools/compiler/ti-cgt-c2000_22.6.0.LTS/include
    7032                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x30)
    7033                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x14)
    7034              
    7035                      .dwendtag $C$DW$TU$28
    7036              
    7037              
    7038              $C$DW$TU$111    .dwtag  DW_TAG_type_unit
    7039                      .dwmtype  $C$DW$T$111
    7040              $C$DW$469       .dwtag  DW_TAG_TI_far_type
    7041                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$28)
    7042              
    7043              $C$DW$T$111     .dwtag  DW_TAG_volatile_type
    7044                      .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$469)
    7045              
    7046                      .dwendtag $C$DW$TU$111
    7047              
    7048              
    7049              $C$DW$TU$13     .dwtag  DW_TAG_type_unit
    7050                      .dwmtype  $C$DW$T$13
    7051              $C$DW$T$13      .dwtag  DW_TAG_base_type
    7052                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    7053                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    7054                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    7055              
    7056                      .dwendtag $C$DW$TU$13
    7057              
    7058              
TMS320C2000 Assembler PC v22.6.0 Wed Aug 14 19:15:24 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc.asm                                                            PAGE  140

    7059              $C$DW$TU$44     .dwtag  DW_TAG_type_unit
    7060                      .dwmtype  $C$DW$T$44
    7061              $C$DW$T$44      .dwtag  DW_TAG_typedef
    7062                      .dwattr $C$DW$T$44, DW_AT_name("__uint32_t")
    7063                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$13)
    7064                      .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/ccs1240/ccs/tools/compiler/ti-cgt-c2000_22.6.0.LTS/include
    7065                      .dwattr $C$DW$T$44, DW_AT_decl_line(0x43)
    7066                      .dwattr $C$DW$T$44, DW_AT_decl_column(0x1c)
    7067              
    7068                      .dwendtag $C$DW$TU$44
    7069              
    7070              
    7071              $C$DW$TU$45     .dwtag  DW_TAG_type_unit
    7072                      .dwmtype  $C$DW$T$45
    7073              $C$DW$T$45      .dwtag  DW_TAG_typedef
    7074                      .dwattr $C$DW$T$45, DW_AT_name("uint32_t")
    7075                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    7076                      .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/ccs1240/ccs/tools/compiler/ti-cgt-c2000_22.6.0.LTS/include
    7077                      .dwattr $C$DW$T$45, DW_AT_decl_line(0x46)
    7078                      .dwattr $C$DW$T$45, DW_AT_decl_column(0x15)
    7079              
    7080                      .dwendtag $C$DW$TU$45
    7081              
    7082              
    7083              $C$DW$TU$114    .dwtag  DW_TAG_type_unit
    7084                      .dwmtype  $C$DW$T$114
    7085              $C$DW$470       .dwtag  DW_TAG_TI_far_type
    7086                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$45)
    7087              
    7088              $C$DW$T$114     .dwtag  DW_TAG_volatile_type
    7089                      .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$470)
    7090              
    7091                      .dwendtag $C$DW$TU$114
    7092              
    7093              
    7094              $C$DW$TU$14     .dwtag  DW_TAG_type_unit
    7095                      .dwmtype  $C$DW$T$14
    7096              $C$DW$T$14      .dwtag  DW_TAG_base_type
    7097                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    7098                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    7099                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    7100              
    7101                      .dwendtag $C$DW$TU$14
    7102              
    7103              
    7104              $C$DW$TU$15     .dwtag  DW_TAG_type_unit
    7105                      .dwmtype  $C$DW$T$15
    7106              $C$DW$T$15      .dwtag  DW_TAG_base_type
    7107                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    7108                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    7109                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    7110              
    7111                      .dwendtag $C$DW$TU$15
    7112              
    7113              
TMS320C2000 Assembler PC v22.6.0 Wed Aug 14 19:15:24 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc.asm                                                            PAGE  141

    7114              $C$DW$TU$16     .dwtag  DW_TAG_type_unit
    7115                      .dwmtype  $C$DW$T$16
    7116              $C$DW$T$16      .dwtag  DW_TAG_base_type
    7117                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    7118                      .dwattr $C$DW$T$16, DW_AT_name("float")
    7119                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    7120              
    7121                      .dwendtag $C$DW$TU$16
    7122              
    7123              
    7124              $C$DW$TU$40     .dwtag  DW_TAG_type_unit
    7125                      .dwmtype  $C$DW$T$40
    7126              
    7127              $C$DW$T$40      .dwtag  DW_TAG_array_type
    7128                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$16)
    7129                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    7130              $C$DW$471       .dwtag  DW_TAG_subrange_type
    7131                      .dwattr $C$DW$471, DW_AT_upper_bound(0x01)
    7132              
    7133                      .dwendtag $C$DW$T$40
    7134              
    7135                      .dwendtag $C$DW$TU$40
    7136              
    7137              
    7138              $C$DW$TU$122    .dwtag  DW_TAG_type_unit
    7139                      .dwmtype  $C$DW$T$122
    7140              $C$DW$472       .dwtag  DW_TAG_TI_far_type
    7141                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$16)
    7142              
    7143              $C$DW$T$122     .dwtag  DW_TAG_const_type
    7144                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$472)
    7145              
    7146                      .dwendtag $C$DW$TU$122
    7147              
    7148              
    7149              $C$DW$TU$19     .dwtag  DW_TAG_type_unit
    7150                      .dwmtype  $C$DW$T$19
    7151              $C$DW$T$19      .dwtag  DW_TAG_typedef
    7152                      .dwattr $C$DW$T$19, DW_AT_name("float32_t")
    7153                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$16)
    7154                      .dwattr $C$DW$T$19, DW_AT_decl_file("..\clllc_settings.h")
    7155                      .dwattr $C$DW$T$19, DW_AT_decl_line(0x26)
    7156                      .dwattr $C$DW$T$19, DW_AT_decl_column(0x1f)
    7157              
    7158                      .dwendtag $C$DW$TU$19
    7159              
    7160              
    7161              $C$DW$TU$20     .dwtag  DW_TAG_type_unit
    7162                      .dwmtype  $C$DW$T$20
    7163              $C$DW$T$20      .dwtag  DW_TAG_pointer_type
    7164                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    7165                      .dwattr $C$DW$T$20, DW_AT_address_class(0x20)
    7166              
    7167                      .dwendtag $C$DW$TU$20
    7168              
TMS320C2000 Assembler PC v22.6.0 Wed Aug 14 19:15:24 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc.asm                                                            PAGE  142

    7169              
    7170              $C$DW$TU$123    .dwtag  DW_TAG_type_unit
    7171                      .dwmtype  $C$DW$T$123
    7172              
    7173              $C$DW$T$123     .dwtag  DW_TAG_array_type
    7174                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$19)
    7175                      .dwattr $C$DW$T$123, DW_AT_byte_size(0xc8)
    7176              $C$DW$473       .dwtag  DW_TAG_subrange_type
    7177                      .dwattr $C$DW$473, DW_AT_upper_bound(0x63)
    7178              
    7179                      .dwendtag $C$DW$T$123
    7180              
    7181                      .dwendtag $C$DW$TU$123
    7182              
    7183              
    7184              $C$DW$TU$124    .dwtag  DW_TAG_type_unit
    7185                      .dwmtype  $C$DW$T$124
    7186              $C$DW$474       .dwtag  DW_TAG_TI_far_type
    7187                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$19)
    7188              
    7189              $C$DW$T$124     .dwtag  DW_TAG_volatile_type
    7190                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$474)
    7191              
    7192                      .dwendtag $C$DW$TU$124
    7193              
    7194              
    7195              $C$DW$TU$17     .dwtag  DW_TAG_type_unit
    7196                      .dwmtype  $C$DW$T$17
    7197              $C$DW$T$17      .dwtag  DW_TAG_base_type
    7198                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    7199                      .dwattr $C$DW$T$17, DW_AT_name("double")
    7200                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x04)
    7201              
    7202                      .dwendtag $C$DW$TU$17
    7203              
    7204              
    7205              $C$DW$TU$38     .dwtag  DW_TAG_type_unit
    7206                      .dwmtype  $C$DW$T$38
    7207              
    7208              $C$DW$T$38      .dwtag  DW_TAG_array_type
    7209                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$17)
    7210                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x08)
    7211              $C$DW$475       .dwtag  DW_TAG_subrange_type
    7212                      .dwattr $C$DW$475, DW_AT_upper_bound(0x01)
    7213              
    7214                      .dwendtag $C$DW$T$38
    7215              
    7216                      .dwendtag $C$DW$TU$38
    7217              
    7218              
    7219              $C$DW$TU$125    .dwtag  DW_TAG_type_unit
    7220                      .dwmtype  $C$DW$T$125
    7221              $C$DW$T$125     .dwtag  DW_TAG_pointer_type
    7222                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$17)
    7223                      .dwattr $C$DW$T$125, DW_AT_address_class(0x20)
TMS320C2000 Assembler PC v22.6.0 Wed Aug 14 19:15:24 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc.asm                                                            PAGE  143

    7224              
    7225                      .dwendtag $C$DW$TU$125
    7226              
    7227              
    7228              $C$DW$TU$126    .dwtag  DW_TAG_type_unit
    7229                      .dwmtype  $C$DW$T$126
    7230              $C$DW$476       .dwtag  DW_TAG_TI_far_type
    7231                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$125)
    7232              
    7233              $C$DW$T$126     .dwtag  DW_TAG_const_type
    7234                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$476)
    7235              
    7236                      .dwendtag $C$DW$TU$126
    7237              
    7238              
    7239              $C$DW$TU$18     .dwtag  DW_TAG_type_unit
    7240                      .dwmtype  $C$DW$T$18
    7241              $C$DW$T$18      .dwtag  DW_TAG_base_type
    7242                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    7243                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    7244                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    7245              
    7246                      .dwendtag $C$DW$TU$18
    7247              
    7248              
    7249              $C$DW$TU$42     .dwtag  DW_TAG_type_unit
    7250                      .dwmtype  $C$DW$T$42
    7251              
    7252              $C$DW$T$42      .dwtag  DW_TAG_array_type
    7253                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$18)
    7254                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x08)
    7255              $C$DW$477       .dwtag  DW_TAG_subrange_type
    7256                      .dwattr $C$DW$477, DW_AT_upper_bound(0x01)
    7257              
    7258                      .dwendtag $C$DW$T$42
    7259              
    7260                      .dwendtag $C$DW$TU$42
    7261              
    7262              
    7263              $C$DW$TU$128    .dwtag  DW_TAG_type_unit
    7264                      .dwmtype  $C$DW$T$128
    7265              $C$DW$T$128     .dwtag  DW_TAG_pointer_type
    7266                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$18)
    7267                      .dwattr $C$DW$T$128, DW_AT_address_class(0x20)
    7268              
    7269                      .dwendtag $C$DW$TU$128
    7270              
    7271              
    7272              $C$DW$TU$129    .dwtag  DW_TAG_type_unit
    7273                      .dwmtype  $C$DW$T$129
    7274              $C$DW$478       .dwtag  DW_TAG_TI_far_type
    7275                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$128)
    7276              
    7277              $C$DW$T$129     .dwtag  DW_TAG_const_type
    7278                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$478)
TMS320C2000 Assembler PC v22.6.0 Wed Aug 14 19:15:24 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc.asm                                                            PAGE  144

    7279              
    7280                      .dwendtag $C$DW$TU$129
    7281              
    7282              
    7283              $C$DW$TU$131    .dwtag  DW_TAG_type_unit
    7284                      .dwmtype  $C$DW$T$131
    7285              $C$DW$T$131     .dwtag  DW_TAG_base_type
    7286                      .dwattr $C$DW$T$131, DW_AT_encoding(DW_ATE_unsigned_char)
    7287                      .dwattr $C$DW$T$131, DW_AT_name("unsigned char")
    7288                      .dwattr $C$DW$T$131, DW_AT_byte_size(0x01)
    7289              
    7290                      .dwendtag $C$DW$TU$131
    7291              
    7292              
    7293              $C$DW$TU$46     .dwtag  DW_TAG_type_unit
    7294                      .dwmtype  $C$DW$T$46
    7295              
    7296              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    7297                      .dwattr $C$DW$T$46, DW_AT_name("dcl_css")
    7298                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x0a)
    7299              $C$DW$479       .dwtag  DW_TAG_member
    7300                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$19)
    7301                      .dwattr $C$DW$479, DW_AT_name("tpt")
    7302                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    7303                      .dwattr $C$DW$479, DW_AT_decl_file("C:\Users\ZXC\Documents\mcu project\ti-project\clllc_nonpowerSUITE
    7304                      .dwattr $C$DW$479, DW_AT_decl_line(0xc1)
    7305                      .dwattr $C$DW$479, DW_AT_decl_column(0x0f)
    7306              
    7307              $C$DW$480       .dwtag  DW_TAG_member
    7308                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$19)
    7309                      .dwattr $C$DW$480, DW_AT_name("T")
    7310                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7311                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    7312                      .dwattr $C$DW$480, DW_AT_decl_file("C:\Users\ZXC\Documents\mcu project\ti-project\clllc_nonpowerSUITE
    7313                      .dwattr $C$DW$480, DW_AT_decl_line(0xc2)
    7314                      .dwattr $C$DW$480, DW_AT_decl_column(0x0f)
    7315              
    7316              $C$DW$481       .dwtag  DW_TAG_member
    7317                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$45)
    7318                      .dwattr $C$DW$481, DW_AT_name("sts")
    7319                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7320                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    7321                      .dwattr $C$DW$481, DW_AT_decl_file("C:\Users\ZXC\Documents\mcu project\ti-project\clllc_nonpowerSUITE
    7322                      .dwattr $C$DW$481, DW_AT_decl_line(0xc3)
    7323                      .dwattr $C$DW$481, DW_AT_decl_column(0x0e)
    7324              
    7325              $C$DW$482       .dwtag  DW_TAG_member
    7326                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$45)
    7327                      .dwattr $C$DW$482, DW_AT_name("err")
    7328                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7329                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    7330                      .dwattr $C$DW$482, DW_AT_decl_file("C:\Users\ZXC\Documents\mcu project\ti-project\clllc_nonpowerSUITE
    7331                      .dwattr $C$DW$482, DW_AT_decl_line(0xc4)
    7332                      .dwattr $C$DW$482, DW_AT_decl_column(0x0e)
    7333              
TMS320C2000 Assembler PC v22.6.0 Wed Aug 14 19:15:24 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc.asm                                                            PAGE  145

    7334              $C$DW$483       .dwtag  DW_TAG_member
    7335                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$45)
    7336                      .dwattr $C$DW$483, DW_AT_name("loc")
    7337                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7338                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    7339                      .dwattr $C$DW$483, DW_AT_decl_file("C:\Users\ZXC\Documents\mcu project\ti-project\clllc_nonpowerSUITE
    7340                      .dwattr $C$DW$483, DW_AT_decl_line(0xc5)
    7341                      .dwattr $C$DW$483, DW_AT_decl_column(0x0e)
    7342              
    7343                      .dwattr $C$DW$T$46, DW_AT_decl_file("C:\Users\ZXC\Documents\mcu project\ti-project\clllc_nonpowerSUIT
    7344                      .dwattr $C$DW$T$46, DW_AT_decl_line(0xc0)
    7345                      .dwattr $C$DW$T$46, DW_AT_decl_column(0x10)
    7346                      .dwendtag $C$DW$T$46
    7347              
    7348                      .dwendtag $C$DW$TU$46
    7349              
    7350              
    7351              $C$DW$TU$49     .dwtag  DW_TAG_type_unit
    7352                      .dwmtype  $C$DW$T$49
    7353              $C$DW$T$49      .dwtag  DW_TAG_typedef
    7354                      .dwattr $C$DW$T$49, DW_AT_name("DCL_CSS")
    7355                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$46)
    7356                      .dwattr $C$DW$T$49, DW_AT_decl_file("C:\Users\ZXC\Documents\mcu project\ti-project\clllc_nonpowerSUIT
    7357                      .dwattr $C$DW$T$49, DW_AT_decl_line(0xc6)
    7358                      .dwattr $C$DW$T$49, DW_AT_decl_column(0x03)
    7359              
    7360                      .dwendtag $C$DW$TU$49
    7361              
    7362              
    7363              $C$DW$TU$50     .dwtag  DW_TAG_type_unit
    7364                      .dwmtype  $C$DW$T$50
    7365              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    7366                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    7367                      .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
    7368              
    7369                      .dwendtag $C$DW$TU$50
    7370              
    7371              
    7372              $C$DW$TU$51     .dwtag  DW_TAG_type_unit
    7373                      .dwmtype  $C$DW$T$51
    7374              
    7375              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    7376                      .dwattr $C$DW$T$51, DW_AT_name("dcl_df13")
    7377                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x24)
    7378              $C$DW$484       .dwtag  DW_TAG_member
    7379                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$19)
    7380                      .dwattr $C$DW$484, DW_AT_name("b0")
    7381                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    7382                      .dwattr $C$DW$484, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7383                      .dwattr $C$DW$484, DW_AT_decl_line(0x40d)
    7384                      .dwattr $C$DW$484, DW_AT_decl_column(0x0f)
    7385              
    7386              $C$DW$485       .dwtag  DW_TAG_member
    7387                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$19)
    7388                      .dwattr $C$DW$485, DW_AT_name("b1")
TMS320C2000 Assembler PC v22.6.0 Wed Aug 14 19:15:24 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc.asm                                                            PAGE  146

    7389                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7390                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    7391                      .dwattr $C$DW$485, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7392                      .dwattr $C$DW$485, DW_AT_decl_line(0x40e)
    7393                      .dwattr $C$DW$485, DW_AT_decl_column(0x0f)
    7394              
    7395              $C$DW$486       .dwtag  DW_TAG_member
    7396                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$19)
    7397                      .dwattr $C$DW$486, DW_AT_name("b2")
    7398                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7399                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    7400                      .dwattr $C$DW$486, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7401                      .dwattr $C$DW$486, DW_AT_decl_line(0x40f)
    7402                      .dwattr $C$DW$486, DW_AT_decl_column(0x0f)
    7403              
    7404              $C$DW$487       .dwtag  DW_TAG_member
    7405                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$19)
    7406                      .dwattr $C$DW$487, DW_AT_name("b3")
    7407                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7408                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    7409                      .dwattr $C$DW$487, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7410                      .dwattr $C$DW$487, DW_AT_decl_line(0x410)
    7411                      .dwattr $C$DW$487, DW_AT_decl_column(0x0f)
    7412              
    7413              $C$DW$488       .dwtag  DW_TAG_member
    7414                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$19)
    7415                      .dwattr $C$DW$488, DW_AT_name("a0")
    7416                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7417                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    7418                      .dwattr $C$DW$488, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7419                      .dwattr $C$DW$488, DW_AT_decl_line(0x411)
    7420                      .dwattr $C$DW$488, DW_AT_decl_column(0x0f)
    7421              
    7422              $C$DW$489       .dwtag  DW_TAG_member
    7423                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$19)
    7424                      .dwattr $C$DW$489, DW_AT_name("a1")
    7425                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7426                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    7427                      .dwattr $C$DW$489, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7428                      .dwattr $C$DW$489, DW_AT_decl_line(0x412)
    7429                      .dwattr $C$DW$489, DW_AT_decl_column(0x0f)
    7430              
    7431              $C$DW$490       .dwtag  DW_TAG_member
    7432                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$19)
    7433                      .dwattr $C$DW$490, DW_AT_name("a2")
    7434                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7435                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    7436                      .dwattr $C$DW$490, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7437                      .dwattr $C$DW$490, DW_AT_decl_line(0x413)
    7438                      .dwattr $C$DW$490, DW_AT_decl_column(0x0f)
    7439              
    7440              $C$DW$491       .dwtag  DW_TAG_member
    7441                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$19)
    7442                      .dwattr $C$DW$491, DW_AT_name("a3")
    7443                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
TMS320C2000 Assembler PC v22.6.0 Wed Aug 14 19:15:24 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc.asm                                                            PAGE  147

    7444                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    7445                      .dwattr $C$DW$491, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7446                      .dwattr $C$DW$491, DW_AT_decl_line(0x414)
    7447                      .dwattr $C$DW$491, DW_AT_decl_column(0x0f)
    7448              
    7449              $C$DW$492       .dwtag  DW_TAG_member
    7450                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$19)
    7451                      .dwattr $C$DW$492, DW_AT_name("d0")
    7452                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7453                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    7454                      .dwattr $C$DW$492, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7455                      .dwattr $C$DW$492, DW_AT_decl_line(0x417)
    7456                      .dwattr $C$DW$492, DW_AT_decl_column(0x0f)
    7457              
    7458              $C$DW$493       .dwtag  DW_TAG_member
    7459                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$19)
    7460                      .dwattr $C$DW$493, DW_AT_name("d1")
    7461                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7462                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    7463                      .dwattr $C$DW$493, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7464                      .dwattr $C$DW$493, DW_AT_decl_line(0x418)
    7465                      .dwattr $C$DW$493, DW_AT_decl_column(0x0f)
    7466              
    7467              $C$DW$494       .dwtag  DW_TAG_member
    7468                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$19)
    7469                      .dwattr $C$DW$494, DW_AT_name("d2")
    7470                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7471                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    7472                      .dwattr $C$DW$494, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7473                      .dwattr $C$DW$494, DW_AT_decl_line(0x419)
    7474                      .dwattr $C$DW$494, DW_AT_decl_column(0x0f)
    7475              
    7476              $C$DW$495       .dwtag  DW_TAG_member
    7477                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$19)
    7478                      .dwattr $C$DW$495, DW_AT_name("d3")
    7479                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7480                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    7481                      .dwattr $C$DW$495, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7482                      .dwattr $C$DW$495, DW_AT_decl_line(0x41a)
    7483                      .dwattr $C$DW$495, DW_AT_decl_column(0x0f)
    7484              
    7485              $C$DW$496       .dwtag  DW_TAG_member
    7486                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$19)
    7487                      .dwattr $C$DW$496, DW_AT_name("d4")
    7488                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7489                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    7490                      .dwattr $C$DW$496, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7491                      .dwattr $C$DW$496, DW_AT_decl_line(0x41b)
    7492                      .dwattr $C$DW$496, DW_AT_decl_column(0x0f)
    7493              
    7494              $C$DW$497       .dwtag  DW_TAG_member
    7495                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$19)
    7496                      .dwattr $C$DW$497, DW_AT_name("d5")
    7497                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7498                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Wed Aug 14 19:15:24 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc.asm                                                            PAGE  148

    7499                      .dwattr $C$DW$497, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7500                      .dwattr $C$DW$497, DW_AT_decl_line(0x41c)
    7501                      .dwattr $C$DW$497, DW_AT_decl_column(0x0f)
    7502              
    7503              $C$DW$498       .dwtag  DW_TAG_member
    7504                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$19)
    7505                      .dwattr $C$DW$498, DW_AT_name("d6")
    7506                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7507                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    7508                      .dwattr $C$DW$498, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7509                      .dwattr $C$DW$498, DW_AT_decl_line(0x41d)
    7510                      .dwattr $C$DW$498, DW_AT_decl_column(0x0f)
    7511              
    7512              $C$DW$499       .dwtag  DW_TAG_member
    7513                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$19)
    7514                      .dwattr $C$DW$499, DW_AT_name("d7")
    7515                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7516                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    7517                      .dwattr $C$DW$499, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7518                      .dwattr $C$DW$499, DW_AT_decl_line(0x41e)
    7519                      .dwattr $C$DW$499, DW_AT_decl_column(0x0f)
    7520              
    7521              $C$DW$500       .dwtag  DW_TAG_member
    7522                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$48)
    7523                      .dwattr $C$DW$500, DW_AT_name("sps")
    7524                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7525                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    7526                      .dwattr $C$DW$500, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
