TMS320C2000 Assembler PC v22.6.0 Fri Aug 30 17:52:41 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc_main.asm                                                       PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.0.LTS *
       3              ;* Date/Time created: Fri Aug 30 17:52:40 2024                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --cla_support=cla2 --diag_wrap=off --float_support=fpu32 --hll_source=on --
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../clllc_main.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.0.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\ZXC\Documents\mcu project\ti-project\clllc_nonpowerSUITE_F
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("Interrupt_enable")
      16                      .dwattr $C$DW$1, DW_AT_linkage_name("Interrupt_enable")

    7162              
    7163              $C$DW$TU$25     .dwtag  DW_TAG_type_unit
    7164                      .dwmtype  $C$DW$T$25
    7165              
    7166              $C$DW$T$25      .dwtag  DW_TAG_array_type
    7167                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$17)
    7168                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x08)
    7169              $C$DW$333       .dwtag  DW_TAG_subrange_type
    7170                      .dwattr $C$DW$333, DW_AT_upper_bound(0x01)
    7171              
    7172                      .dwendtag $C$DW$T$25
    7173              
    7174                      .dwendtag $C$DW$TU$25
    7175              
    7176              
    7177              $C$DW$TU$98     .dwtag  DW_TAG_type_unit
    7178                      .dwmtype  $C$DW$T$98
    7179              $C$DW$T$98      .dwtag  DW_TAG_pointer_type
    7180                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$17)
    7181                      .dwattr $C$DW$T$98, DW_AT_address_class(0x20)
TMS320C2000 Assembler PC v22.6.0 Fri Aug 30 17:52:41 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc_main.asm                                                       PAGE  150

    7182              
    7183                      .dwendtag $C$DW$TU$98
    7184              
    7185              
    7186              $C$DW$TU$99     .dwtag  DW_TAG_type_unit
    7187                      .dwmtype  $C$DW$T$99
    7188              $C$DW$334       .dwtag  DW_TAG_TI_far_type
    7189                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$98)
    7190              
    7191              $C$DW$T$99      .dwtag  DW_TAG_const_type
    7192                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$334)
    7193              
    7194                      .dwendtag $C$DW$TU$99
    7195              
    7196              
    7197              $C$DW$TU$18     .dwtag  DW_TAG_type_unit
    7198                      .dwmtype  $C$DW$T$18
    7199              $C$DW$T$18      .dwtag  DW_TAG_base_type
    7200                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    7201                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    7202                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    7203              
    7204                      .dwendtag $C$DW$TU$18
    7205              
    7206              
    7207              $C$DW$TU$29     .dwtag  DW_TAG_type_unit
    7208                      .dwmtype  $C$DW$T$29
    7209              
    7210              $C$DW$T$29      .dwtag  DW_TAG_array_type
    7211                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$18)
    7212                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    7213              $C$DW$335       .dwtag  DW_TAG_subrange_type
    7214                      .dwattr $C$DW$335, DW_AT_upper_bound(0x01)
    7215              
    7216                      .dwendtag $C$DW$T$29
    7217              
    7218                      .dwendtag $C$DW$TU$29
    7219              
    7220              
    7221              $C$DW$TU$101    .dwtag  DW_TAG_type_unit
    7222                      .dwmtype  $C$DW$T$101
    7223              $C$DW$T$101     .dwtag  DW_TAG_pointer_type
    7224                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$18)
    7225                      .dwattr $C$DW$T$101, DW_AT_address_class(0x20)
    7226              
    7227                      .dwendtag $C$DW$TU$101
    7228              
    7229              
    7230              $C$DW$TU$102    .dwtag  DW_TAG_type_unit
    7231                      .dwmtype  $C$DW$T$102
    7232              $C$DW$336       .dwtag  DW_TAG_TI_far_type
    7233                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$101)
    7234              
    7235              $C$DW$T$102     .dwtag  DW_TAG_const_type
    7236                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$336)
TMS320C2000 Assembler PC v22.6.0 Fri Aug 30 17:52:41 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc_main.asm                                                       PAGE  151

    7237              
    7238                      .dwendtag $C$DW$TU$102
    7239              
    7240              
    7241              $C$DW$TU$104    .dwtag  DW_TAG_type_unit
    7242                      .dwmtype  $C$DW$T$104
    7243              $C$DW$T$104     .dwtag  DW_TAG_base_type
    7244                      .dwattr $C$DW$T$104, DW_AT_encoding(DW_ATE_unsigned_char)
    7245                      .dwattr $C$DW$T$104, DW_AT_name("unsigned char")
    7246                      .dwattr $C$DW$T$104, DW_AT_byte_size(0x01)
    7247              
    7248                      .dwendtag $C$DW$TU$104
    7249              
    7250              
    7251              $C$DW$TU$34     .dwtag  DW_TAG_type_unit
    7252                      .dwmtype  $C$DW$T$34
    7253              
    7254              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    7255                      .dwattr $C$DW$T$34, DW_AT_name("dcl_css")
    7256                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x0a)
    7257              $C$DW$337       .dwtag  DW_TAG_member
    7258                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$31)
    7259                      .dwattr $C$DW$337, DW_AT_name("tpt")
    7260                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    7261                      .dwattr $C$DW$337, DW_AT_decl_file("C:\Users\ZXC\Documents\mcu project\ti-project\clllc_nonpowerSUITE
    7262                      .dwattr $C$DW$337, DW_AT_decl_line(0xc1)
    7263                      .dwattr $C$DW$337, DW_AT_decl_column(0x0f)
    7264              
    7265              $C$DW$338       .dwtag  DW_TAG_member
    7266                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$31)
    7267                      .dwattr $C$DW$338, DW_AT_name("T")
    7268                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7269                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    7270                      .dwattr $C$DW$338, DW_AT_decl_file("C:\Users\ZXC\Documents\mcu project\ti-project\clllc_nonpowerSUITE
    7271                      .dwattr $C$DW$338, DW_AT_decl_line(0xc2)
    7272                      .dwattr $C$DW$338, DW_AT_decl_column(0x0f)
    7273              
    7274              $C$DW$339       .dwtag  DW_TAG_member
    7275                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$33)
    7276                      .dwattr $C$DW$339, DW_AT_name("sts")
    7277                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7278                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    7279                      .dwattr $C$DW$339, DW_AT_decl_file("C:\Users\ZXC\Documents\mcu project\ti-project\clllc_nonpowerSUITE
    7280                      .dwattr $C$DW$339, DW_AT_decl_line(0xc3)
    7281                      .dwattr $C$DW$339, DW_AT_decl_column(0x0e)
    7282              
    7283              $C$DW$340       .dwtag  DW_TAG_member
    7284                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$33)
    7285                      .dwattr $C$DW$340, DW_AT_name("err")
    7286                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7287                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    7288                      .dwattr $C$DW$340, DW_AT_decl_file("C:\Users\ZXC\Documents\mcu project\ti-project\clllc_nonpowerSUITE
    7289                      .dwattr $C$DW$340, DW_AT_decl_line(0xc4)
    7290                      .dwattr $C$DW$340, DW_AT_decl_column(0x0e)
    7291              
TMS320C2000 Assembler PC v22.6.0 Fri Aug 30 17:52:41 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc_main.asm                                                       PAGE  152

    7292              $C$DW$341       .dwtag  DW_TAG_member
    7293                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$33)
    7294                      .dwattr $C$DW$341, DW_AT_name("loc")
    7295                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7296                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    7297                      .dwattr $C$DW$341, DW_AT_decl_file("C:\Users\ZXC\Documents\mcu project\ti-project\clllc_nonpowerSUITE
    7298                      .dwattr $C$DW$341, DW_AT_decl_line(0xc5)
    7299                      .dwattr $C$DW$341, DW_AT_decl_column(0x0e)
    7300              
    7301                      .dwattr $C$DW$T$34, DW_AT_decl_file("C:\Users\ZXC\Documents\mcu project\ti-project\clllc_nonpowerSUIT
    7302                      .dwattr $C$DW$T$34, DW_AT_decl_line(0xc0)
    7303                      .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    7304                      .dwendtag $C$DW$T$34
    7305              
    7306                      .dwendtag $C$DW$TU$34
    7307              
    7308              
    7309              $C$DW$TU$37     .dwtag  DW_TAG_type_unit
    7310                      .dwmtype  $C$DW$T$37
    7311              $C$DW$T$37      .dwtag  DW_TAG_typedef
    7312                      .dwattr $C$DW$T$37, DW_AT_name("DCL_CSS")
    7313                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$34)
    7314                      .dwattr $C$DW$T$37, DW_AT_decl_file("C:\Users\ZXC\Documents\mcu project\ti-project\clllc_nonpowerSUIT
    7315                      .dwattr $C$DW$T$37, DW_AT_decl_line(0xc6)
    7316                      .dwattr $C$DW$T$37, DW_AT_decl_column(0x03)
    7317              
    7318                      .dwendtag $C$DW$TU$37
    7319              
    7320              
    7321              $C$DW$TU$38     .dwtag  DW_TAG_type_unit
    7322                      .dwmtype  $C$DW$T$38
    7323              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    7324                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    7325                      .dwattr $C$DW$T$38, DW_AT_address_class(0x20)
    7326              
    7327                      .dwendtag $C$DW$TU$38
    7328              
    7329              
    7330              $C$DW$TU$39     .dwtag  DW_TAG_type_unit
    7331                      .dwmtype  $C$DW$T$39
    7332              
    7333              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    7334                      .dwattr $C$DW$T$39, DW_AT_name("dcl_df13")
    7335                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x24)
    7336              $C$DW$342       .dwtag  DW_TAG_member
    7337                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$31)
    7338                      .dwattr $C$DW$342, DW_AT_name("b0")
    7339                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    7340                      .dwattr $C$DW$342, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7341                      .dwattr $C$DW$342, DW_AT_decl_line(0x40d)
    7342                      .dwattr $C$DW$342, DW_AT_decl_column(0x0f)
    7343              
    7344              $C$DW$343       .dwtag  DW_TAG_member
    7345                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$31)
    7346                      .dwattr $C$DW$343, DW_AT_name("b1")
TMS320C2000 Assembler PC v22.6.0 Fri Aug 30 17:52:41 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc_main.asm                                                       PAGE  153

    7347                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7348                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    7349                      .dwattr $C$DW$343, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7350                      .dwattr $C$DW$343, DW_AT_decl_line(0x40e)
    7351                      .dwattr $C$DW$343, DW_AT_decl_column(0x0f)
    7352              
    7353              $C$DW$344       .dwtag  DW_TAG_member
    7354                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$31)
    7355                      .dwattr $C$DW$344, DW_AT_name("b2")
    7356                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7357                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    7358                      .dwattr $C$DW$344, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7359                      .dwattr $C$DW$344, DW_AT_decl_line(0x40f)
    7360                      .dwattr $C$DW$344, DW_AT_decl_column(0x0f)
    7361              
    7362              $C$DW$345       .dwtag  DW_TAG_member
    7363                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$31)
    7364                      .dwattr $C$DW$345, DW_AT_name("b3")
    7365                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7366                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    7367                      .dwattr $C$DW$345, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7368                      .dwattr $C$DW$345, DW_AT_decl_line(0x410)
    7369                      .dwattr $C$DW$345, DW_AT_decl_column(0x0f)
    7370              
    7371              $C$DW$346       .dwtag  DW_TAG_member
    7372                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$31)
    7373                      .dwattr $C$DW$346, DW_AT_name("a0")
    7374                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7375                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    7376                      .dwattr $C$DW$346, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7377                      .dwattr $C$DW$346, DW_AT_decl_line(0x411)
    7378                      .dwattr $C$DW$346, DW_AT_decl_column(0x0f)
    7379              
    7380              $C$DW$347       .dwtag  DW_TAG_member
    7381                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$31)
    7382                      .dwattr $C$DW$347, DW_AT_name("a1")
    7383                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7384                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    7385                      .dwattr $C$DW$347, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7386                      .dwattr $C$DW$347, DW_AT_decl_line(0x412)
    7387                      .dwattr $C$DW$347, DW_AT_decl_column(0x0f)
    7388              
    7389              $C$DW$348       .dwtag  DW_TAG_member
    7390                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$31)
    7391                      .dwattr $C$DW$348, DW_AT_name("a2")
    7392                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7393                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    7394                      .dwattr $C$DW$348, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7395                      .dwattr $C$DW$348, DW_AT_decl_line(0x413)
    7396                      .dwattr $C$DW$348, DW_AT_decl_column(0x0f)
    7397              
    7398              $C$DW$349       .dwtag  DW_TAG_member
    7399                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$31)
    7400                      .dwattr $C$DW$349, DW_AT_name("a3")
    7401                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
TMS320C2000 Assembler PC v22.6.0 Fri Aug 30 17:52:41 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc_main.asm                                                       PAGE  154

    7402                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    7403                      .dwattr $C$DW$349, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7404                      .dwattr $C$DW$349, DW_AT_decl_line(0x414)
    7405                      .dwattr $C$DW$349, DW_AT_decl_column(0x0f)
    7406              
    7407              $C$DW$350       .dwtag  DW_TAG_member
    7408                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$31)
    7409                      .dwattr $C$DW$350, DW_AT_name("d0")
    7410                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7411                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    7412                      .dwattr $C$DW$350, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7413                      .dwattr $C$DW$350, DW_AT_decl_line(0x417)
    7414                      .dwattr $C$DW$350, DW_AT_decl_column(0x0f)
    7415              
    7416              $C$DW$351       .dwtag  DW_TAG_member
    7417                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$31)
    7418                      .dwattr $C$DW$351, DW_AT_name("d1")
    7419                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7420                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    7421                      .dwattr $C$DW$351, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7422                      .dwattr $C$DW$351, DW_AT_decl_line(0x418)
    7423                      .dwattr $C$DW$351, DW_AT_decl_column(0x0f)
    7424              
    7425              $C$DW$352       .dwtag  DW_TAG_member
    7426                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$31)
    7427                      .dwattr $C$DW$352, DW_AT_name("d2")
    7428                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7429                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    7430                      .dwattr $C$DW$352, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7431                      .dwattr $C$DW$352, DW_AT_decl_line(0x419)
    7432                      .dwattr $C$DW$352, DW_AT_decl_column(0x0f)
    7433              
    7434              $C$DW$353       .dwtag  DW_TAG_member
    7435                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$31)
    7436                      .dwattr $C$DW$353, DW_AT_name("d3")
    7437                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7438                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    7439                      .dwattr $C$DW$353, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7440                      .dwattr $C$DW$353, DW_AT_decl_line(0x41a)
    7441                      .dwattr $C$DW$353, DW_AT_decl_column(0x0f)
    7442              
    7443              $C$DW$354       .dwtag  DW_TAG_member
    7444                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$31)
    7445                      .dwattr $C$DW$354, DW_AT_name("d4")
    7446                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7447                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    7448                      .dwattr $C$DW$354, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7449                      .dwattr $C$DW$354, DW_AT_decl_line(0x41b)
    7450                      .dwattr $C$DW$354, DW_AT_decl_column(0x0f)
    7451              
    7452              $C$DW$355       .dwtag  DW_TAG_member
    7453                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$31)
    7454                      .dwattr $C$DW$355, DW_AT_name("d5")
    7455                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7456                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Fri Aug 30 17:52:41 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc_main.asm                                                       PAGE  155

    7457                      .dwattr $C$DW$355, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7458                      .dwattr $C$DW$355, DW_AT_decl_line(0x41c)
    7459                      .dwattr $C$DW$355, DW_AT_decl_column(0x0f)
    7460              
    7461              $C$DW$356       .dwtag  DW_TAG_member
    7462                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$31)
    7463                      .dwattr $C$DW$356, DW_AT_name("d6")
    7464                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7465                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    7466                      .dwattr $C$DW$356, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7467                      .dwattr $C$DW$356, DW_AT_decl_line(0x41d)
    7468                      .dwattr $C$DW$356, DW_AT_decl_column(0x0f)
    7469              
    7470              $C$DW$357       .dwtag  DW_TAG_member
    7471                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$31)
    7472                      .dwattr $C$DW$357, DW_AT_name("d7")
    7473                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7474                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    7475                      .dwattr $C$DW$357, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7476                      .dwattr $C$DW$357, DW_AT_decl_line(0x41e)
    7477                      .dwattr $C$DW$357, DW_AT_decl_column(0x0f)
    7478              
    7479              $C$DW$358       .dwtag  DW_TAG_member
    7480                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$36)
    7481                      .dwattr $C$DW$358, DW_AT_name("sps")
    7482                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7483                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    7484                      .dwattr $C$DW$358, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7485                      .dwattr $C$DW$358, DW_AT_decl_line(0x420)
    7486                      .dwattr $C$DW$358, DW_AT_decl_column(0x13)
    7487              
    7488              $C$DW$359       .dwtag  DW_TAG_member
    7489                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$38)
    7490                      .dwattr $C$DW$359, DW_AT_name("css")
    7491                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    7492                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    7493                      .dwattr $C$DW$359, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7494                      .dwattr $C$DW$359, DW_AT_decl_line(0x421)
    7495                      .dwattr $C$DW$359, DW_AT_decl_column(0x0e)
    7496              
    7497                      .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUIT
    7498                      .dwattr $C$DW$T$39, DW_AT_decl_line(0x40b)
    7499                      .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    7500                      .dwendtag $C$DW$T$39
    7501              
    7502                      .dwendtag $C$DW$TU$39
    7503              
    7504              
    7505              $C$DW$TU$94     .dwtag  DW_TAG_type_unit
    7506                      .dwmtype  $C$DW$T$94
    7507              $C$DW$T$94      .dwtag  DW_TAG_typedef
    7508                      .dwattr $C$DW$T$94, DW_AT_name("DCL_DF13")
    7509                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$39)
    7510                      .dwattr $C$DW$T$94, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUIT
    7511                      .dwattr $C$DW$T$94, DW_AT_decl_line(0x422)
TMS320C2000 Assembler PC v22.6.0 Fri Aug 30 17:52:41 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc_main.asm                                                       PAGE  156

    7512                      .dwattr $C$DW$T$94, DW_AT_decl_column(0x03)
    7513              
    7514                      .dwendtag $C$DW$TU$94
    7515              
    7516              
    7517              $C$DW$TU$40     .dwtag  DW_TAG_type_unit
    7518                      .dwmtype  $C$DW$T$40
    7519              
    7520              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    7521                      .dwattr $C$DW$T$40, DW_AT_name("dcl_df13_sps")
    7522                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x10)
    7523              $C$DW$360       .dwtag  DW_TAG_member
    7524                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$31)
    7525                      .dwattr $C$DW$360, DW_AT_name("b0")
    7526                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    7527                      .dwattr $C$DW$360, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7528                      .dwattr $C$DW$360, DW_AT_decl_line(0x3fd)
    7529                      .dwattr $C$DW$360, DW_AT_decl_column(0x0f)
    7530              
    7531              $C$DW$361       .dwtag  DW_TAG_member
    7532                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$31)
    7533                      .dwattr $C$DW$361, DW_AT_name("b1")
    7534                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7535                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    7536                      .dwattr $C$DW$361, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7537                      .dwattr $C$DW$361, DW_AT_decl_line(0x3fe)
    7538                      .dwattr $C$DW$361, DW_AT_decl_column(0x0f)
    7539              
    7540              $C$DW$362       .dwtag  DW_TAG_member
    7541                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$31)
    7542                      .dwattr $C$DW$362, DW_AT_name("b2")
    7543                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7544                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    7545                      .dwattr $C$DW$362, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7546                      .dwattr $C$DW$362, DW_AT_decl_line(0x3ff)
    7547                      .dwattr $C$DW$362, DW_AT_decl_column(0x0f)
    7548              
    7549              $C$DW$363       .dwtag  DW_TAG_member
    7550                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$31)
    7551                      .dwattr $C$DW$363, DW_AT_name("b3")
    7552                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7553                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    7554                      .dwattr $C$DW$363, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7555                      .dwattr $C$DW$363, DW_AT_decl_line(0x400)
    7556                      .dwattr $C$DW$363, DW_AT_decl_column(0x0f)
    7557              
    7558              $C$DW$364       .dwtag  DW_TAG_member
    7559                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$31)
    7560                      .dwattr $C$DW$364, DW_AT_name("a0")
    7561                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7562                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    7563                      .dwattr $C$DW$364, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7564                      .dwattr $C$DW$364, DW_AT_decl_line(0x401)
    7565                      .dwattr $C$DW$364, DW_AT_decl_column(0x0f)
    7566              
TMS320C2000 Assembler PC v22.6.0 Fri Aug 30 17:52:41 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc_main.asm                                                       PAGE  157

    7567              $C$DW$365       .dwtag  DW_TAG_member
    7568                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$31)
    7569                      .dwattr $C$DW$365, DW_AT_name("a1")
    7570                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7571                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    7572                      .dwattr $C$DW$365, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7573                      .dwattr $C$DW$365, DW_AT_decl_line(0x402)
    7574                      .dwattr $C$DW$365, DW_AT_decl_column(0x0f)
    7575              
    7576              $C$DW$366       .dwtag  DW_TAG_member
    7577                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$31)
    7578                      .dwattr $C$DW$366, DW_AT_name("a2")
    7579                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7580                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    7581                      .dwattr $C$DW$366, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7582                      .dwattr $C$DW$366, DW_AT_decl_line(0x403)
    7583                      .dwattr $C$DW$366, DW_AT_decl_column(0x0f)
    7584              
    7585              $C$DW$367       .dwtag  DW_TAG_member
    7586                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$31)
    7587                      .dwattr $C$DW$367, DW_AT_name("a3")
    7588                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7589                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    7590                      .dwattr $C$DW$367, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUITE
    7591                      .dwattr $C$DW$367, DW_AT_decl_line(0x404)
    7592                      .dwattr $C$DW$367, DW_AT_decl_column(0x0f)
    7593              
    7594                      .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUIT
    7595                      .dwattr $C$DW$T$40, DW_AT_decl_line(0x3fc)
    7596                      .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    7597                      .dwendtag $C$DW$T$40
    7598              
    7599                      .dwendtag $C$DW$TU$40
    7600              
    7601              
    7602              $C$DW$TU$35     .dwtag  DW_TAG_type_unit
    7603                      .dwmtype  $C$DW$T$35
    7604              $C$DW$T$35      .dwtag  DW_TAG_typedef
    7605                      .dwattr $C$DW$T$35, DW_AT_name("DCL_DF13_SPS")
    7606                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$40)
    7607                      .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/ZXC/Documents/mcu project/ti-project/clllc_nonpowerSUIT
    7608                      .dwattr $C$DW$T$35, DW_AT_decl_line(0x405)
    7609                      .dwattr $C$DW$T$35, DW_AT_decl_column(0x03)
    7610              
    7611                      .dwendtag $C$DW$TU$35
    7612              
    7613              
    7614              $C$DW$TU$36     .dwtag  DW_TAG_type_unit
    7615                      .dwmtype  $C$DW$T$36
    7616              $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    7617                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    7618                      .dwattr $C$DW$T$36, DW_AT_address_class(0x20)
    7619              
    7620                      .dwendtag $C$DW$TU$36
    7621              
TMS320C2000 Assembler PC v22.6.0 Fri Aug 30 17:52:41 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc_main.asm                                                       PAGE  158


No Assembly Errors, No Assembly Warnings
